/* Завдання 1
Написати розв’язок нижче описаного завдання (по одному рядку коду на кожний пункт)
1.	Створіть змінну city з типом даних string.
2.	Присвойте їй значення «Київ».
3.	Змініть значення змінної city на «Львів».
4.	Створіть змінну address з типом даних string і скопіюйте в неї значення змінної city.
5.	Вивести значення змінної address з допомогою команди console.log().
 */

let city: string;
city = 'Kyiv';
city = "Lviv";
let addres: string = city;
console.log(`1. ${addres}`);

/* Завдання 2
Використовуючи конструкцію if..else через тернарний вираз, напишіть код, який отримує число через prompt, а потім виводить в console.log() повідомлення:
1.	Число парне.
2.	Число непарне.
3.	Число 0.
 */

let a: number = +prompt('Введіть ціле число:');
(a === 0)
    ? console.log('2. Число 0')
    : ((a % 2) == 0)
        ? console.log(`2. Число ${a} парне`)
        : console.log(`2. Число ${a} непарне`)


/* Завдання 3
Написати розв’язок нижче описаного завдання за допомогою function declaration:
1.	Потрібно створити функцію, яка повертає максимальний переданий їй числовий параметр.
2.	Кількість параметрів у функції може бути від 2х і більше.
Приклад роботи:
1.	max(5,-2) – має повернути 5.
2.	max(5,-2, 30, 6) – має повернути 30
*/

function maximum(...arg: number[]): number {
    return Math.max(...arg);
}

let m: number = maximum(2, 5, 0, -4, 21, -9);
console.log(`3. Максимальне число`, m);

/* Завдання 4
Напишіть функцію getSqrt(number), яка вираховує корінь квадратний. 
Для визначення кореня використовуйте Math. 
В залежності від того що передали в функцію має виводити наступні повідомлення:
•	Якщо передане число повертати - Квадратний корінь з стільки то дорівнює стільки то.
•	Якщо передали не число - Повинно бути числове значення.
•	Якщо число менше 0 - Введіть додатнє число.
•	Якщо в функцію нічого не передали - Будь ласка, введіть число!
*/

function getSqrt(chyslo: number) {
    let res: string;
    if (isNaN(chyslo))
        res = 'Повинно бути числове значення'
    else {
        (chyslo > 0)
            ? res = `Корінь квадратний із ${chyslo} = ${Math.sqrt(chyslo)}`
            : res = 'Введіть додатнє число'
    }
    return res;
}
let b = +prompt('Введіть число:');
console.log(`4.`, getSqrt(b));

/* Завдання 5
Необхідно відтворити функціонал як на відео Cenzor, а саме:
•	При кліку на ADD добавляти заборонене слово, яке відображатиметься в списку “Bad words”
•	Якщо поле для добавлення слова не заповнене виводити відповідне повідомлення
•	При кліку на Cenzor перевіряється чи є в textarea заборонене слово, якщо так його заміняє на *, причому на ту кількість яка довжина слова
•	Якщо textarea порожня виводити повыдолення про заповнення поля
 */